# Books (Core)

By Jeffrey Prichard

![png](Data/erdvisual.png)

## Imports/Settings

In [1]:
import pandas as pd
import numpy as np

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database

fromurllib.parse import quote_plus

## MySQL Connect

In [2]:
#create connection string using credentions
import json
with open('/Users/jeffrey/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
connection = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/books"

engine = create_engine(connection)

In [4]:
conn = engine.connect()

In [5]:
## Check for database
if database_exists(connection):
    print("It Exists!")
else:
    create_database(connection)
    print("New Database Created.")

It Exists!

## Show the Tables

In [6]:
# preview names of tables
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

# Authors

In [7]:
authors = pd.read_csv('Data/authors.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [8]:
authors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [25]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q,conn)
describe

,Field,Type,Null,Key,Default,Extra
0,id,int,NO,PRI,None,auto_increment
1,author_name,varchar(45),YES,,None,
2,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [26]:
describe['Field'].values

array(['id', 'author_name', 'created_at', 'updated_at'], dtype=object)

In [27]:
authors.columns

Index(['id', 'author_name'], dtype='object')

In [28]:
authors.to_sql("authors", conn, index=False, if_exists='append')

5

# Books

In [9]:
books = pd.read_csv('Data/books.csv')
books.head()

   id            book_title  authors_id
0   1           The Shining           1
1   2                    It           1
2   3      The Great Gatsby           2
3   4  The Call of the Wild           3
4   5   Pride and Prejudice           4

In [10]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          6 non-null      int64
 1   book_title  6 non-null      object
 2   authors_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [30]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q,conn)
describe

,Field,Type,Null,Key,Default,Extra
0,id,int,NO,PRI,None,auto_increment
1,book_title,varchar(45),YES,,None,
2,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP
4,authors_id,int,NO,MUL,None,

In [31]:
describe['Field'].values

array(['id', 'book_title', 'created_at', 'updated_at', 'authors_id'],
      dtype=object)

In [32]:
books.columns

Index(['id', 'book_title', 'authors_id'], dtype='object')

In [34]:
books.to_sql("books", conn, index=False, if_exists='append')

6

# Users

In [11]:
users = pd.read_csv('Data/users.csv')
users.head()

   id first_name  last_name        customer_email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [12]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              3 non-null      int64
 1   first_name      3 non-null      object
 2   last_name       3 non-null      object
 3   customer_email  3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

In [35]:
q = '''DESCRIBE users;'''
describe = pd.read_sql(q,conn)
describe

,Field,Type,Null,Key,Default,Extra
0,id,int,NO,PRI,None,auto_increment
1,first_name,varchar(45),YES,,None,
2,last_name,varchar(45),YES,,None,
3,customer_email,varchar(45),YES,,None,
4,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
5,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [36]:
describe['Field'].values

array(['id', 'first_name', 'last_name', 'customer_email', 'created_at',
       'updated_at'], dtype=object)

In [37]:
users.columns

Index(['id', 'first_name', 'last_name', 'customer_email'], dtype='object')

In [38]:
users.to_sql("users", conn, index=False, if_exists='append')

3

# Favorites

In [13]:
favorites = pd.read_csv('Data/favorites.csv')
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [14]:
favorites.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

In [39]:
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(q,conn)
describe

     Field Type Null  Key Default Extra
0  user_id  int  YES  MUL    None
1  book_id  int  YES  MUL    None

In [40]:
describe['Field'].values

array(['user_id', 'book_id'], dtype=object)

In [41]:
favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [42]:
favorites.to_sql("favorites", conn, index=False, if_exists='append')

7

# Show Tables

In [15]:
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [43]:
q = """
SELECT books.book_title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q, conn)

         book_title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1